title: CJ FinanceFront Mshta Proxy Execution
id: 9a2a0a2a-cj-001
status: experimental
description: Detect mshta vbscript/javascript proxy execution consistent with CINDER JACKAL.
author: IgniteCyber Academy
date: 2026/02/03
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: '\mshta.exe'
  selection_terms:
    CommandLine|contains:
      - 'vbscript:Execute('
      - 'javascript:'
      - 'GetObject('
      - '.hta'
  condition: selection_img and selection_terms
falsepositives:
  - Rare legit HTA usage
level: high
tags:
  - attack.defense_evasion
  - attack.t1218.005
